#!/usr/bin/env python
# encoding-8
'''
@author
@contact@gmail.com
@file.py.py
@time/6/5 16:04
@desc:

'''

Vul_List = [
    "其他",
    "SQL注入",
    "命令注入",
    "路径穿越",
    "LDAP注入",
    "XPATH注入",
    "远程命令执行",
    "拒绝服务攻击",
    "SSRF",
    "CSRF",
    "XSS",
    "日志注入",
    "HTTP响应头截断",
    "开放式重定向",
    "XXE",
    "对象注入",
    "任意文件上传",
    "不安全组件",
    "文件包含",
    "XML注入",
    "信息泄露",
    "变量覆盖",
    "反序列化漏洞",
    "任意文件删除",
    "任意文件写",
    "原型链污染",
    "不安全的反射",
    "表达式注入",
    "配置注入",
    "任意文件读",
    "任意代码执行",
    "默认配置",
    "业务逻辑漏洞",
    "权限绕过",
    "权限提升",
    "模板注入",
    "沙箱逃逸",
]

Vul_link_Type_Dict = {
    "可信数据的反序列化": "反序列化漏洞",
    "对路径名的限制不恰当（路径遍历）": "路径穿越",
    "对生成代码的控制不恰当（代码注入）": "任意代码执行",
    "ASP.NET误配置：配置文件中存储口令": "默认配置",
    "输出中的特殊元素转义处理不恰当（注入）": "命令注入",
    "SQL命令中使用的特殊元素转义处理不恰当（SQL注入）": "SQL注入",
    "危险类型文件的不加限制上传": "任意文件上传",
    "认证机制不恰当": "权限绕过",
    "属主管理不恰当": "权限提升",
    "授权机制不恰当": "权限提升",
    "在命令中使用的特殊元素转义处理不恰当（命令注入）": "命令注入",
    "转义、元或控制序列转义处理不恰当": "任意代码执行",
    "相对路径遍历": "任意文件读",
    "不安全的默认资源初始化": "默认配置",
    "Improper Neutralization of Special Elements Used in a Template Engine": "模板注入",
    "缺省权限不正确": "权限绕过",
    "信息暴露": "信息泄露",
    "服务端请求伪造（SSRF）": "SSRF",
}
